app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."user_id" = ?  ORDER BY date DESC  [["user_id", 2]]
---
  def index
    @events = @user.events.order("date DESC").all

INSERT INTO "events" ("title", "date", "type_repeat", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Событие 1"], ["date", "2014-03-23"], ["type_repeat", "monthly"], ["created_at", "2015-11-22 06:14:50.069743"], ["updated_at", "2015-11-22 06:14:50.069743"]]
SELECT  "events".* FROM "events" WHERE "events"."user_id" = ?  ORDER BY "events"."id" DESC LIMIT 1  [["user_id", 2]]
---
  def create
    @user.events << Event.create(event_params)

    if @user.events.last.errors.empty?

UPDATE "events" SET "title" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["title", "sdfsdfsadf222"], ["updated_at", "2015-11-30 12:46:48.154036"], ["id", 12]]
---
  def update
    @event.update_attributes(event_params)

SELECT  "events".* FROM "events" WHERE "events"."user_id" = ? AND "events"."id" = ? LIMIT 1  [["user_id", 4], ["id", 10]]
---
  def find_event
    @user = find_user
    @event = @user.events.find(params[:id])