app/controllers/registrations_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("email", "name", "last_name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)