app/controllers/users_controller.rb

UPDATE "users" SET "name" = ?, "last_name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Адель"], ["last_name", "Хаматов"], ["password_digest", "$2a$10$PoootzLxC82DbTRS2WcdEehcZjxdiQES.1NjZNc/YVS4dR0sn1VFu"], ["updated_at", "2015-11-26 14:30:31.343808"], ["id", 2]]
---
  def update
    @user.update_attributes(
      name: params[:user][:name],
      last_name: params[:user][:last_name],
      password: params[:user][:password],
      password: params[:user][:password_confirmation]
    )